rkz/extension/InformationRegisters/бит_ЗначенияПризнаковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_ЗначенияПризнаковНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ПризнакиНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПризнакСертификации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Признак</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/CommonModules/бит_РасчетДанныхРесурснойСпецификации/Ext/Module.bsl
Процедура РассчитатьНеттоРасчетный(СпецификацияОбъект, Отказ) Экспорт
	// {{ПервыйБИТ ЛистТребований [ЛТ5.12]  [VUVaynula@1cbit.ru] [29.07.2025 3:34:15] +     
	Если Константы.бит_РассчитыватьВесНеттоВСпецифиациях.Получить() = Ложь 
		Или Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (СпецификацияОбъект.Статус = Перечисления.СтатусыСпецификаций.Действует 
		И (СпецификацияОбъект.Ссылка.Статус = Перечисления.СтатусыСпецификаций.Закрыта
			Или СпецификацияОбъект.Ссылка.Статус = Перечисления.СтатусыСпецификаций.ВРазработке)) Тогда
			Возврат;
	КонецЕсли;     
	ВесНетто = 0;                         
	// ---------------------------------------------------------------------------------------
	мВидовНоменклатурГП = ПолучитьМассивВидовНоменклатурГП();
	Если мВидовНоменклатурГП.Найти(СпецификацияОбъект.ОсновноеИзделиеНоменклатура.ВидНоменклатуры) = Неопределено Тогда 
		// Это не ГП, значит возврат;
		Возврат;
	КонецЕсли;
	// ---------------------------------------------------------------------------------------  
	мТара = ПолучитьМассивТиповТара();
	// ---------------------------------------------------------------------------------------  
	Для каждого стр из СпецификацияОбъект.МатериалыИУслуги Цикл 
		Если мТара.Найти(стр.Номенклатура.ТипНоменклатуры) <> Неопределено Тогда 
			Продолжить; // Тару не берем
		КонецЕсли;
		
		Если стр.ПроизводитсяВПроцессе Тогда
			// Это ПФ. ИщемСпецификацию и разузловка   
			ВесЕдиницы = Разузловка(стр.Номенклатура, мТара, Отказ);
		Иначе
			ВесЕдиницы = НеттоЕдиницы(стр.Номенклатура, Отказ);   
		КонецЕсли;
		Если Отказ Или ВесЕдиницы = Неопределено Тогда
			Если Пользователи.ЭтоПолноправныйПользователь() Тогда
				Отказ = Ложь;
			КонецЕсли;
			
			Возврат;
		КонецЕсли;
		ЭтоЦелеваяСпецификация = Истина;
		ВесПоСтроке = ВесДляМатериала(ВесЕдиницы, стр, СпецификацияОбъект, ЭтоЦелеваяСпецификация);
        ВесНетто = ВесНетто + ВесПоСтроке;
	КонецЦикла;
	// ---------------------------------------------------------------------------------------
	СпецификацияОбъект.бит_ВесНеттоРасчетный = ВесНетто;
	
	МЗ = РегистрыСведений.бит_ЗначенияПризнаковНоменклатуры.СоздатьМенеджерЗаписи();
	МЗ.бит_Номенклатура = СпецификацияОбъект.ОсновноеИзделиеНоменклатура;
	МЗ.бит_Признак = Справочники.бит_ЗначенияПоУмолчанию.ПризнакВесНетто.Значение;
	МЗ.бит_Значение = ВесНетто;  
	МЗ.Записать();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.12]  [VUVaynula@1cbit.ru] [29.07.2025 3:34:15] -
КонецПроцедуры

Функция ВесДляМатериала(Знач ВесЕдиницы, Знач стр, Знач Спецификация, ЭтоЦелеваяСпецификация = Ложь)
	// коэф.укрутки
	КоэффициентУкрутки = ?(ЗначениеЗаполнено(стр.бит_КоэффициентУкрутки), стр.бит_КоэффициентУкрутки, 1);
	ВесПоСтроке = ВесЕдиницы * стр.бит_КоличествоПозиции * КоэффициентУкрутки;
	// высыхание лака
	ПризнакВысыханиеЛака = ПризнакВысыханиеЛака(стр.Номенклатура);
	Если ПризнакВысыханиеЛака <> Неопределено Тогда
		ВесПоСтроке = ВесЕдиницы * стр.бит_КоличествоПозиции * ПризнакВысыханиеЛака;
	КонецЕсли;
	// ИспользуетсяПересчетЕдиницИзмерения
	ПересчетЕдиницИзмерения = ПересчетЕдиницИзмерения(стр.Номенклатура);
	Если ПересчетЕдиницИзмерения <> Неопределено Тогда
		ВесПоСтроке = ВесЕдиницы * стр.бит_КоличествоПозиции * ПересчетЕдиницИзмерения;
	КонецЕсли;    
	
	Если ЭтоЦелеваяСпецификация Тогда // для целевой спецификации не нужно пересчитывать кратность и единицу измерения.
		ВесПоСтрокеНаЕдиницуПоСпецификации = ВесПоСтроке;
	Иначе
		//Посчитаем кратность по спецификации
		ОсновноеИзделиеУпаковка = Спецификация.ОсновноеИзделиеУпаковка; 
		ОсновноеИзделиеКоличествоУпаковок = Спецификация.ОсновноеИзделиеКоличествоУпаковок;
		ОсновноеИзделиеНоменклатура = Спецификация.ОсновноеИзделиеНоменклатура;
		КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(ОсновноеИзделиеУпаковка, ОсновноеИзделиеНоменклатура); 	
		КоличествоПоСпецификации = КоэффициентУпаковки * ОсновноеИзделиеКоличествоУпаковок;
		ВесПоСтрокеНаЕдиницуПоСпецификации = ВесПоСтроке/КоличествоПоСпецификации;
	КонецЕсли;
	
	Возврат ВесПоСтрокеНаЕдиницуПоСпецификации;

КонецФункции            

Функция ПолучитьМассивВидовНоменклатурГП()
	
	мВидов = Новый Массив;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыНоменклатуры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	                      |ГДЕ
	                      |	ВидыНоменклатуры.Ссылка В ИЕРАРХИИ(&мВидовГП)
	                      |	И НЕ ВидыНоменклатуры.ЭтоГруппа"); 
	
	тВидовГП = Справочники.бит_ЗначенияПоУмолчанию.ВидНоменклатурыГотоваяПродукция;
	Если тВидовГП.Значения.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить виды ГП", тВидовГП);
		Возврат мВидов;	
	КонецЕсли; 
	Запрос.УстановитьПараметр("мВидовГП", тВидовГП.Значения.Выгрузить(, "Значение").ВыгрузитьКолонку("Значение")); 
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции   

Функция НеттоЕдиницы(Номенклатура, Отказ)
	
	//Признак = Справочники.бит_ЗначенияПоУмолчанию.ПризнакВесНетто.Значение;
	//НеттоЕдиницы = ПолучитьПризнакИзЗапроса(Номенклатура, Признак);        
	//Если Не ЗначениеЗаполнено(НеттоЕдиницы) Тогда
	//	Отказ = Истина;  
	//	НеттоЕдиницы = Неопределено;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вес для " + Номенклатура);
	//КонецЕсли;                      
	Если Номенклатура.ВесИспользовать И Номенклатура.ВесЧислитель > 0 Тогда 
		НеттоЕдиницы = Номенклатура.ВесЧислитель;
	Иначе
		НеттоЕдиницы = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вес для " + Номенклатура); 
		Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НеттоЕдиницы;

КонецФункции     

Функция ПолучитьПризнакИзЗапроса(Номенклатура, Признак)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Первые 1
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК ЗначениеПризнака
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &Номенклатура
	                      |	И бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &Признак
	                      |	И бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации 
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ Первые 1
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Значение
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &Номенклатура
	                      |	И бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &Признак
	                      |	И Не бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации ");
	Запрос.УстановитьПараметр("Признак", Признак);
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);    
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеПризнака = Выборка.ЗначениеПризнака;
	Иначе                  
		ЗначениеПризнака = Неопределено;
	КонецЕсли;
	
	Возврат ЗначениеПризнака;
		
КонецФункции

Функция ПризнакВысыханиеЛака(Номенклатура)  
	
	Признак = Справочники.бит_ЗначенияПоУмолчанию.ПризнакИспользуетсяКакЛак.Значение;
	Результат = ПолучитьПризнакИзЗапроса(Номенклатура, Признак);
	Если Результат <> Истина Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Признак = Справочники.бит_ЗначенияПоУмолчанию.ПризнакВысыханиеЛака.Значение;
	Результат = ПолучитьПризнакИзЗапроса(Номенклатура, Признак); 
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Неопределено;
	КонецЕсли;    
	
	Возврат Результат;
	
КонецФункции

Функция ПересчетЕдиницИзмерения(Номенклатура)  
	
	Признак = Справочники.бит_ЗначенияПоУмолчанию.ПризнакИспользуетсяПересчетЕдиницИзмерения.Значение;
	Результат = ПолучитьПризнакИзЗапроса(Номенклатура, Признак);
	Если Результат <> Истина Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Признак = Справочники.бит_ЗначенияПоУмолчанию.ПризнакПересчетЕдиницИзмерения.Значение;
	Результат = ПолучитьПризнакИзЗапроса(Номенклатура, Признак); 
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = Неопределено;
	КонецЕсли;    
	
	Возврат Результат;
	
КонецФункции

Функция Разузловка(Номенклатура, мТара, Отказ)
	
	ВесНетто = 0;
	Спецификация = СпецификацияНоменклатуры(Номенклатура, ТекущаяДатаСеанса());  // Найдем спецификацию
	Если Спецификация.МатериалыИУслуги.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для номенклатуры " + Номенклатура + " в спецификации " + Спецификация + " нет материалов для расчета веса", Спецификация);	
	Иначе	
		Для каждого стр из Спецификация.МатериалыИУслуги Цикл 
			Если мТара.Найти(стр.Номенклатура.ТипНоменклатуры) <> Неопределено Тогда 
				Продолжить; // Тару не берем
			КонецЕсли;
			
			Если стр.ПроизводитсяВПроцессе Тогда
				// Это ПФ. ИщемСпецификацию и разузловка   
				ВесЕдиницы = Разузловка(стр.Номенклатура, мТара, Отказ);
			Иначе
				ВесЕдиницы = НеттоЕдиницы(стр.Номенклатура, Отказ);   
			КонецЕсли;
			Если Отказ Или ВесЕдиницы = Неопределено Тогда
				Возврат ВесЕдиницы;
			КонецЕсли;
			ВесПоСтроке = ВесДляМатериала(ВесЕдиницы, стр, Спецификация);
	        ВесНетто = ВесНетто + ВесПоСтроке;

		КонецЦикла;  
	КонецЕсли;
	
	Если ВесНетто = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для номенклатуры " + Номенклатура + " вес не определен");
		Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
			Отказ = Истина;
		Иначе    
			ВесНетто = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВесНетто; 

КонецФункции  

Функция СпецификацияНоменклатуры(Номенклатура, Дата = Неопределено) Экспорт
	
	Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();

	Если ЗначениеЗаполнено(Номенклатура) Тогда
			
		Запрос = Новый Запрос("ВЫБРАТЬ
			|	РесурсныеСпецификации.НачалоДействия КАК НачалоДействия,
			|	РесурсныеСпецификации.Ссылка КАК Спецификация
			|ИЗ
			|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
			|ГДЕ
			|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &Номенклатура
			|	И РесурсныеСпецификации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
			|	И ВЫБОР
			|			КОГДА РесурсныеСпецификации.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИСТИНА
			|			КОГДА РесурсныеСпецификации.КонецДействия >= &Дата
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|	И РесурсныеСпецификации.НачалоДействия <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачалоДействия УБЫВ
			|");
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, Дата("00010101"), Дата));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Спецификация = Выборка.Спецификация;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Спецификация;
	
КонецФункции

Функция ПолучитьМассивТиповТара()
	
	тТара = Справочники.бит_ЗначенияПоУмолчанию.ТипНоменклатурыТара.Значения.Выгрузить(, "Значение");
	Если тТара.Количество() Тогда
		мТара = тТара.ВыгрузитьКолонку("Значение");
	Иначе     
		мТара = Новый Массив;
	КонецЕсли;
	
	Возврат мТара;

КонецФункции
